---
kind: other
id: Properties.T:Autodesk.Revit.DB.ViewNavigationToolSettings
source: html/7d1f9cd9-97d4-7900-aa59-44bd19e51c31.htm
---
# ViewNavigationToolSettings Properties

The id of the assembly instance to which the element belongs.